# All Preprocessed Data Frames

Showcases the results of the preprocessing.

In [1]:
from __future__ import division
import codecs
import json
import ConfigParser
import sys
import pandas as pd
from IPython.display import display

In [2]:
config = ConfigParser.SafeConfigParser()
my_config = '/Users/das/work/svn/Gits/a_Projects/Projects/Infrastructure/dsg-vision/Config/default.cfg'
with codecs.open(my_config, 'r', encoding='utf-8') as f:
    config.readfp(f)

corpora_base = config.get('DEFAULT', 'corpora_base')

dsgv_home = config.get('DSGV-PATHS', 'dsgv_home')
sys.path.append(dsgv_home + '/Utils')
from utils import icorpus_code, plot_labelled_bb, get_image_filename

In [3]:
wac_preproc_path_2018 = dsgv_home + '/Preproc/PreprocOut/'

In [4]:
dfs = ['saiapr_bbdf', 'mscoco_bbdf', 'refcoco_refdf', 'refcocoplus_refdf', 'grex_refdf',
       'vgregdf', 'vgobjdf', 'vgreldf', 'vgattdf', 'vgvqadf',
       'flickr_bbdf', 'flickr_capdf', 'flickr_objdf',
       'cub_bbdf', 'cub_attrdf', 'cub_partdf']

overview_df = []

for this_df in dfs:
    df_loaded = pd.read_json(wac_preproc_path_2018 + this_df + '.json.gz',
                             typ='frame', orient='split', compression='gzip')
    print '-' * 20, this_df, '-' * 20
    print ''
    print 'n rows: {:,}'.format(len(df_loaded))
    overview_df.append((this_df, len(df_loaded)))
    display(df_loaded.head(5))
    print ''

print '=' * 20, 'Summary', '=' * 20
display(pd.DataFrame(overview_df, columns='name rows'.split()))

-------------------- saiapr_bbdf --------------------

n rows: 99,534

   i_corpus  image_id  region_id                   bb  cat
0         0       112          1   [76, 50, 371, 308]  120
1         0       112          2     [0, 260, 89, 96]  204
2         0       112          3  [390, 206, 89, 151]  204
3         0       112          4     [0, 0, 156, 191]   29
4         0       112          5   [374, 0, 104, 165]   29

-------------------- mscoco_bbdf --------------------

n rows: 196,771

   i_corpus  image_id  region_id                                bb  cat
0         1    480023         86   [116.95, 305.86, 285.3, 266.03]   58
1         1    480023     438029    [75.23, 134.7, 203.17, 215.63]    1
2         1    480023     460329  [239.33, 176.98, 110.56, 133.66]    1
3         1    480023     498741    [394.95, 222.7, 85.05, 197.48]    1
4         1    480023    1200708        [0.0, 0.18, 78.96, 164.01]    1

-------------------- refcoco_refdf --------------------

n rows: 142,210

,i_corpus,image_id,region_id,r_corpus,rex_id,refexp,tagged
0,1,581857,1719310,refcoco,0,the lady with the blue shirt,"[[the, DT], [lady, NN], [with, IN], [the, DT],..."
1,1,581857,1719310,refcoco,1,lady with back to us,"[[lady, NN], [with, IN], [back, NN], [to, TO],..."
2,1,581857,1719310,refcoco,2,blue shirt,"[[blue, JJ], [shirt, NN]]"
3,1,581857,463958,refcoco,3,woman in gray shirt facing camera on right,"[[woman, NN], [in, IN], [gray, JJ], [shirt, NN..."
4,1,581857,463958,refcoco,4,woman gray right,"[[woman, NN], [gray, NN], [right, NN]]"

-------------------- refcocoplus_refdf --------------------

n rows: 141,564

,i_corpus,image_id,region_id,r_corpus,rex_id,refexp,tagged
0,1,581857,1719310,refcoco,0,navy blue shirt,"[[navy, JJ], [blue, NN], [shirt, NN]]"
1,1,581857,1719310,refcoco,1,woman back in blue,"[[woman, NN], [back, RB], [in, IN], [blue, NN]]"
2,1,581857,1719310,refcoco,2,blue shirt,"[[blue, JJ], [shirt, NN]]"
3,1,581857,463958,refcoco,3,gray shirt wearing glasses,"[[gray, JJ], [shirt, NN], [wearing, NN], [glas..."
4,1,581857,463958,refcoco,4,lady with glasses,"[[lady, NN], [with, IN], [glasses, NNS]]"

-------------------- grex_refdf --------------------

n rows: 95,010

,i_corpus,image_id,region_id,r_corpus,rex_id,refexp,tagged
0,1,465670,100000,grex,87967,a brown colored couch with a man laying on it,"[[a, DT], [brown, NN], [colored, VBD], [couch,..."
1,1,470174,100002,grex,40654,a long three cushioned leather couch up agains...,"[[a, DT], [long, JJ], [three, CD], [cushioned,..."
2,1,470174,100002,grex,40655,brown leather looking couch on right side agai...,"[[brown, IN], [leather, RB], [looking, VBG], [..."
3,1,92439,100013,grex,80865,a black leather couch,"[[a, DT], [black, JJ], [leather, NN], [couch, ..."
4,1,473003,100031,grex,77949,a brown couch with no pillows on it,"[[a, DT], [brown, JJ], [couch, NN], [with, IN]..."

-------------------- vgregdf --------------------

n rows: 5,406,592

,i_corpus,image_id,coco_id,flickr_id,region_id,phrase,bb,rel_ids,rels,pphrase
0,5,1,NaN,NaN,1382,the clock is green in colour,"[421, 57, 82, 139]",None,None,None
1,5,1,NaN,NaN,1383,shade is along the street,"[194, 372, 182, 109]",[15927],"[[5045, ON, along.r.01, 5046]]",shade|5045|shade.n.01 is along the street|5046...
2,5,1,NaN,NaN,1384,man is wearing sneakers,"[241, 491, 61, 30]",[15928],"[[1058529, wears, wear.v.01, 5048]]",man|1058529|man.n.01 is wearing sneakers|5048|...
3,5,1,NaN,NaN,1385,cars headlights are off,"[617, 377, 36, 36]",[15929],"[[5049, has, have.v.01, 5050]]",
4,5,1,NaN,NaN,1386,bikes are parked at the far edge,"[322, 298, 41, 49]",None,None,None

-------------------- vgobjdf --------------------

n rows: 3,895,567

   i_corpus  image_id   obj_id            syn      name                    bb
0         5         1  1058498     clock.n.01     clock    [421, 91, 79, 339]
1         5         1     5046    street.n.01    street   [77, 328, 714, 262]
2         5         1     5045     shade.n.01     shade  [119, 338, 274, 192]
3         5         1  1058529       man.n.01       man   [238, 249, 60, 262]
4         5         1     5048  gym_shoe.n.01  sneakers    [243, 489, 52, 26]

-------------------- vgreldf --------------------

n rows: 2,324,859

,i_corpus,image_id,rel_syn,predicate,rel_id,sub_syn,sub_id,obj_syn,obj_id
0,5,1,along.r.01,ON,15927,shade.n.01,5045,street.n.01,5046
1,5,1,wear.v.01,wears,15928,man.n.01,1058529,gym_shoe.n.01,5048
2,5,1,have.v.01,has,15929,car.n.01,5049,headlight.n.01,5050
3,5,1,along.r.01,ON,15930,sign.n.02,1058507,building.n.01,1058508
4,5,1,along.r.01,ON,15931,trunk.n.01,5055,sidewalk.n.01,1058534

-------------------- vgattdf --------------------

n rows: 1,674,166

   i_corpus  image_id   obj_id          attributes
0         5         1  1058498       [green, tall]
1         5         1     5046          [sidewalk]
2         5         1     5048              [grey]
3         5         1     5050               [off]
4         5         1     5051  [parked, far away]

-------------------- vgvqadf --------------------

n rows: 1,445,322

,i_corpus,image_id,qa_id,q,a,q_objs,a_objs,region_id
0,5,1,986768,What color is the clock?,Green.,[],[],1382.0
1,5,1,986769,How many people are there?,Two.,[],[],1383.0
2,5,1,986772,What color is the man's shirt?,Red.,[],[],1434.0
3,5,1,986777,What are the men doing?,Interacting.,[],[],1486.0
4,5,1,986780,Where is the white work truck?,Parked on the street.,[],[],1535.0

-------------------- flickr_bbdf --------------------

n rows: 275,775

   i_corpus    image_id  region_id  subregion_id                   bb
0         8  1000092795          1             1  [159, 125, 60, 210]
1         8  1000092795          4             1   [1, 220, 210, 253]
2         8  1000092795          4             2  [276, 215, 56, 122]
3         8  1000092795          1             2  [197, 110, 64, 263]
4         8  1000092795          5             1  [207, 144, 50, 100]

-------------------- flickr_capdf --------------------

n rows: 158,915

,i_corpus,image_id,caption_annotated,caption_raw,entities
0,8,1000092795,[/EN#1/people Two young guys] with [/EN#2/body...,two young guys with shaggy hair look at their ...,"[1, 2, 3, 8]"
1,8,1000092795,"[/EN#1/people Two young , White males] are out...","two young , white males are outside near many ...","[1, 4]"
2,8,1000092795,[/EN#1/people Two men] in [/EN#5/clothing gree...,two men in green shirts are standing in a yard .,"[1, 5, 9]"
3,8,1000092795,[/EN#6/people A man] in [/EN#7/clothing a blue...,a man in a blue shirt standing in a garden .,"[6, 7, 9]"
4,8,1000092795,[/EN#1/people Two friends] enjoy [/EN#10/other...,two friends enjoy time spent together .,"[1, 10]"

-------------------- flickr_objdf --------------------

n rows: 559,767

   i_corpus    image_id  region_id                   phrase        cat
0         8  1000092795          1           Two young guys     people
1         8  1000092795          2              shaggy hair  bodyparts
2         8  1000092795          3              their hands  bodyparts
3         8  1000092795          8                 the yard      scene
4         8  1000092795          1  Two young , White males     people

-------------------- cub_bbdf --------------------

n rows: 11,787

,i_corpus,image_id,image_path,category,bb
0,9,1,001.Black_footed_Albatross/Black_Footed_Albatr...,Black_footed_Albatross,"[60, 27, 325, 304]"
1,9,2,001.Black_footed_Albatross/Black_Footed_Albatr...,Black_footed_Albatross,"[139, 30, 153, 264]"
2,9,3,001.Black_footed_Albatross/Black_Footed_Albatr...,Black_footed_Albatross,"[14, 112, 388, 186]"
3,9,4,001.Black_footed_Albatross/Black_Footed_Albatr...,Black_footed_Albatross,"[112, 90, 255, 242]"
4,9,5,001.Black_footed_Albatross/Black_Footed_Albatr...,Black_footed_Albatross,"[70, 50, 134, 303]"

-------------------- cub_attrdf --------------------

n rows: 371,011

   i_corpus  image_id               att               val
0         9         1    has_bill_shape    hooked_seabird
1         9         1  has_head_pattern            masked
2         9         1  has_throat_color              buff
3         9         1     has_eye_color             brown
4         9         1   has_bill_length  longer_than_head

-------------------- cub_partdf --------------------

n rows: 141,395

   i_corpus  image_id  part_name    x    y
0         9         1       beak  312  182
1         9         1      crown  186   45
2         9         1   forehead  247   79
3         9         1       nape  100  221
4         9         1  right eye  183  101

==================== Summary ====================

                 name     rows
0         saiapr_bbdf    99534
1         mscoco_bbdf   196771
2       refcoco_refdf   142210
3   refcocoplus_refdf   141564
4          grex_refdf    95010
5             vgregdf  5406592
6             vgobjdf  3895567
7             vgreldf  2324859
8             vgattdf  1674166
9             vgvqadf  1445322
10        flickr_bbdf   275775
11       flickr_capdf   158915
12       flickr_objdf   559767
13           cub_bbdf    11787
14         cub_attrdf   371011
15         cub_partdf   141395